# list = []
# x = 0
# while x <5 :
#      user = input("Enter Number")
#      list.ppend(user)
# list.
#
#-----------------------------------------------------
# x = {1, 2, 3, "a"}
#
#
# x.add(555)
#
# x.pop()
#
# print(x)

# [x:y] რომელი ინდექსიდან რომლამდე წამოვიღო...-------------------------------
# a = "Hello"
# print(a[1:3])      # ორი წერტილი ნიშნავს რომ თუ კი არაფერს არ ჩავუწერო ამოაკომენტაროს ყველაფერი ხოლო თუ ჩავუწერ [1:3] წამოიღებს მე-2 და მე-3 სიმბოლოს.

#-----------------------------------------------------
# from copy import deepcopy
# x = ["a", "b", [1, 5] ]
# print(id(x),x)

# y = x[:]               #y უდრის x-ის ყველა ელემენტს. ამას ქვია შელოუ კოპი.
# y.append("new")        #y ის სიას დაემატება ახალი ელემენტი უკიდურეს მარჯვენა მხარეს
# x[2][1] = 8            # x- ის მე-2 ელემენტის მე1 წევრი შეცვალე და დაწერე 8 -ო
# print(x)
#
# y =x.copy() # ეს არის კოპირების მე-2 მეთოდი, ერთ ლეველზე აკოპირებს მარტო.

# კოპირების ისეთი მეთოდი რომ ორიგინალს საფრთხე არ დაემუქროს არის შემოსატანი დიფ კოპი, es daakopirebs yvela levelze
# y = deepcopy(x)  # ასე ოღნდ თავზე უნდა ეწეროს  from copy import deepcopy ეს

#----------------------------------------------------სიის მეთოდები---
# append - მეთოდი სიაშში უკიდურეს მარჯვენა მხარეს ამატებს ახალ ელემენტს
# Clear - მეთოდი ასუფთავებს მთლიანად სიას
# Copy - მეთოდი აკოპირებს სიას ერთ ლეველზე.
# count - მეთოდი სიაში რამდენჯერაა ერთიდაიგივე ელემენტი მაგას ითვლის
# extend - ამატებს ელემენტებს სიაში ....მაგალიტად x-ში რომ დავამატო y-ის სია
# index -  აითემს გადავცემ და იმ აითემს რომელი ინდექსი შეესაბამება მაგას მიწერს, თუ ისეთ რაღაცას ვეძებ რაც სიაში არაა მიერორებს, if ით კითხულობენ ხოლმე if "7" in y: print(y.index(7)...
# insert - ელემენტს ამატებს როგორც append მაგრამ აქ შეგვიძლია ვუთხრათ ზუსტად რა ადგილას დაამატოს
# pop - უკანასკლნელ ელემენტს ამოშლის და თუ ვეტყვი ინდექსს რომელსაც ვეტყვი იმას ამოშლის
# remove - აითემი შეგყავს და იმ აითემს ეძებს და იმას შლის
# reverse - აითემების თანმიმდევრობის შებრუნება
# sort - სორტირება
#--------------------------განვიხილოთ თითოეული------------------------------------------------
# x = ["a","b", 1, 5]
# y = ["c", "d", 2, 7]
#
# # x.append(1500)        # append - მეთოდი სიაშში უკიდურეს მარჯვენა მხარეს ამატებს ახალ ელემენტს
# x.insert(1,1500)   # insert მეტოდი იქ ჩასვამს სადაც ვეტყვი
#
# print(x)
#-----------------------------------------------სიის გენერირება---------
# x = []
# for i in range(100):
#     x.append(i)
# print(x)
#--------------------------------------ცარიელი სიააააა და შეყვანა 5 მონაცემის და მერე შებრუნება.
#list = []
# x = 0
# while x < 5:
#     y = input(" Enter Your Number")
#     list.append(y)
#     x = x + 1
# print(" Your Entered Numbers are: ", list)
# list[0], list[-1] = list[-1],list[0]
# print(list)
#-------თაფლ მონაცემის ტიპი, არის რომ შიგნით მონაცემი არ იცვლება, თუმცა თუ შიგნიტ სიაა სიის მონაცემი შეიცვლება-------------------------------------
# a = (1,2,"Hello", [1,2,3])
# a[-1][0] = 111
# print(a)
#--------------------------------მონაცემთა ტიპი ---------------------------------
#-------როგორ მოგვაქვს ინფორმაცია ლექსიკონიდან ქის მეშვეობით---------
new_dictionary = {"apple":28, "banana":20, "orange":30}  #ეს არის ლექსიკონი

# print(new_dictionary["apple"])
# new_dictionary ["kivi"] = 15   #ასე ვამატებ ახალ ინფოს ლექსიკონში
# new_dictionary["apple"] = 15   #ასე არსებულს გადააკეთებს
# print(new_dictionary)
# del new_dictionary["apple"]
# print(new_dictionary)
# for item in new_dictionary.items():
#     print(item)
